{
  "code": 200,
  "status": "OK",
  "data": {
    "number": 251,
    "ayahs": [
      {
        "number": 1721,
        "text": "لله سبحانه وتعالى وحده دعوة التوحيد (لا إله إلا الله)، فلا يُعبد ولا يُدعى إلا هو، والآلهة التي يعبدونها من دون الله لا تجيب دعاء مَن دعاها، وحالهم معها كحال عطشان يمد يده إلى الماء من بعيد؛ ليصل إلى فمه فلا يصل إليه، وما سؤال الكافرين لها إلا غاية في البعد عن الصواب لإشراكهم بالله غيره.",
        "surah": {
          "number": 13,
          "name": "سُورَةُ الرَّعۡدِ",
          "englishName": "Ar-Ra'd",
          "englishNameTranslation": "The Thunder",
          "revelationType": "Medinan",
          "numberOfAyahs": 43
        },
        "numberInSurah": 14,
        "juz": 13,
        "manzil": 3,
        "page": 251,
        "ruku": 206,
        "hizbQuarter": 100,
        "sajda": false
      },
      {
        "number": 1722,
        "text": "ولله وحده يسجد خاضعًا منقادًا كُلُّ مَن في السموات والأرض، فيسجد ويخضع له المؤمنون طوعًا واختيارًا، ويخضع له الكافرون رغمًا عنهم؛ لأنهم يستكبرون عن عبادته، وحالهم وفطرتهم تكذِّبهم في ذلك، وتنقاد لعظمته ظلال المخلوقات، فتتحرك بإرادته أول النهار وآخره.",
        "surah": {
          "number": 13,
          "name": "سُورَةُ الرَّعۡدِ",
          "englishName": "Ar-Ra'd",
          "englishNameTranslation": "The Thunder",
          "revelationType": "Medinan",
          "numberOfAyahs": 43
        },
        "numberInSurah": 15,
        "juz": 13,
        "manzil": 3,
        "page": 251,
        "ruku": 206,
        "hizbQuarter": 100,
        "sajda": {
          "id": 2,
          "recommended": true,
          "obligatory": false
        }
      },
      {
        "number": 1723,
        "text": "قل -أيها الرسول- للمشركين: مَن خالق السَّموات والأرض ومدبِّرهما؟ قل: الله هو الخالق المدبر لهما، وأنتم تقرون بذلك، ثم قل لهم ملزمًا بالحجة: أجعلتم غيره معبودين لكم، وهم لا يَقْدرون على نفع أنفسهم أو ضرها فضلا عن نفعكم أو ضركم، وتركتم عبادة مالكها؟ قل لهم -أيها الرسول-: هل يستوي عندكم الكافر -وهو كالأعمى- والمؤمن وهو كالبصير؟ أم هل يستوي عندكم الكفر -وهو كالظلمات- والإيمان -وهو كالنور؟ أم أن أولياءهم الذين جعلوهم شركاء لله يخلقون مثل خَلْقه، فتشابه عليهم خَلْق الشركاء بخلق الله، فاعتقدوا استحقاقهم للعبادة؟ قل لهم -أيها الرسول-: الله تعالى خالق كل كائن من العدم، وهو المستحق للعبادة وحده، وهو الواحد القهار الذي يستحق الألوهية والعبادة، لا الأصنام والأوثان التي لا تضرُّ ولا تنفع.",
        "surah": {
          "number": 13,
          "name": "سُورَةُ الرَّعۡدِ",
          "englishName": "Ar-Ra'd",
          "englishNameTranslation": "The Thunder",
          "revelationType": "Medinan",
          "numberOfAyahs": 43
        },
        "numberInSurah": 16,
        "juz": 13,
        "manzil": 3,
        "page": 251,
        "ruku": 206,
        "hizbQuarter": 100,
        "sajda": false
      },
      {
        "number": 1724,
        "text": "ثم ضرب الله سبحانه مثلا للحق والباطل بماء أنزله من السماء، فجَرَت به أودية الأرض بقدر صغرها وكبرها، فحمل السيل غثاء طافيًا فوقه لا نفع فيه. وضرب مثلا آخر: هو المعادن يوقِدون عليها النار لصهرها طلبًا للزينة كما في الذهب والفضة، أو طلبًا لمنافع ينتفعون بها كما في النحاس، فيخرج منها خبثها مما لا فائدة فيه كالذي كان مع الماء، بمثل هذا يضرب الله المثل للحق والباطل: فالباطل كغثاء الماء يتلاشى أو يُرْمى إذ لا فائدة منه، والحق كالماء الصافي، والمعادن النقية تبقى في الأرض للانتفاع بها، كما بيَّن لكم هذه الأمثال، كذلك يضربها للناس؛ ليتضح الحق من الباطل والهدى من الضلال.",
        "surah": {
          "number": 13,
          "name": "سُورَةُ الرَّعۡدِ",
          "englishName": "Ar-Ra'd",
          "englishNameTranslation": "The Thunder",
          "revelationType": "Medinan",
          "numberOfAyahs": 43
        },
        "numberInSurah": 17,
        "juz": 13,
        "manzil": 3,
        "page": 251,
        "ruku": 206,
        "hizbQuarter": 100,
        "sajda": false
      },
      {
        "number": 1725,
        "text": "للمؤمنين الذين أطاعوا الله ورسوله الجنة، والذين لم يطيعوا وكفروا به لهم النار، ولو كانوا يملكون كل ما في الأرض وضِعْفه معه لبذلوه فداء لأنفسهم من عذاب الله يوم القيامة، ولن يُتَقبل منهم، أولئك يحاسَبون على كل ما أسلفوه من عمل سيِّئ، ومسكنهم ومقامهم جهنم تكون لهم فراشًا، وبئس الفراش الذي مهدوه لأنفسهم.",
        "surah": {
          "number": 13,
          "name": "سُورَةُ الرَّعۡدِ",
          "englishName": "Ar-Ra'd",
          "englishNameTranslation": "The Thunder",
          "revelationType": "Medinan",
          "numberOfAyahs": 43
        },
        "numberInSurah": 18,
        "juz": 13,
        "manzil": 3,
        "page": 251,
        "ruku": 206,
        "hizbQuarter": 100,
        "sajda": false
      }
    ],
    "surahs": {
      "13": {
        "number": 13,
        "name": "سُورَةُ الرَّعۡدِ",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      }
    },
    "edition": {
      "identifier": "ar.muyassar",
      "language": "ar",
      "name": "تفسير المیسر",
      "englishName": "King Fahad Quran Complex",
      "format": "text",
      "type": "tafsir",
      "direction": "rtl"
    }
  }
}