{
  "code": 200,
  "status": "OK",
  "data": {
    "number": 30,
    "ayahs": [
      {
        "number": 198,
        "text": "واقتلوا الذين يقاتلونكم من المشركين حيث وجدتموهم، وأخرجوهم من المكان الذي أخرجوكم منه وهو \"مكة\". والفتنة -وهي الكفر والشرك والصد عن الإسلام- أشد من قتلكم إياهم. ولا تبدؤوهم بالقتال عند المسجد الحرام تعظيمًا لحرماته حتى يبدؤوكم بالقتال فيه، فإن قاتلوكم في المسجد الحرام فاقتلوهم فيه. مثل ذلك الجزاء الرادع يكون جزاء الكافرين.",
        "surah": {
          "number": 2,
          "name": "سُورَةُ البَقَرَةِ",
          "englishName": "Al-Baqara",
          "englishNameTranslation": "The Cow",
          "revelationType": "Medinan",
          "numberOfAyahs": 286
        },
        "numberInSurah": 191,
        "juz": 2,
        "manzil": 1,
        "page": 30,
        "ruku": 25,
        "hizbQuarter": 12,
        "sajda": false
      },
      {
        "number": 199,
        "text": "فإن تركوا ما هم فيه من الكفر وقتالكم عند المسجد الحرام، ودخلوا في الإيمان، فإن الله غفور لعباده، رحيم بهم.",
        "surah": {
          "number": 2,
          "name": "سُورَةُ البَقَرَةِ",
          "englishName": "Al-Baqara",
          "englishNameTranslation": "The Cow",
          "revelationType": "Medinan",
          "numberOfAyahs": 286
        },
        "numberInSurah": 192,
        "juz": 2,
        "manzil": 1,
        "page": 30,
        "ruku": 25,
        "hizbQuarter": 12,
        "sajda": false
      },
      {
        "number": 200,
        "text": "واستمروا- أيها المؤمنون- في قتال المشركين المعتدين، حتى لا تكون فتنة للمسلمين عن دينهم ولا شرك بالله، ويبقى الدين لله وحده خالصًا لا يُعْبَد معه غيره. فإن كفُّوا عن الكفر والقتال فكُفُّوا عنهم؛ فالعقوبة لا تكون إلا على المستمرين على كفرهم وعدوانهم.",
        "surah": {
          "number": 2,
          "name": "سُورَةُ البَقَرَةِ",
          "englishName": "Al-Baqara",
          "englishNameTranslation": "The Cow",
          "revelationType": "Medinan",
          "numberOfAyahs": 286
        },
        "numberInSurah": 193,
        "juz": 2,
        "manzil": 1,
        "page": 30,
        "ruku": 25,
        "hizbQuarter": 12,
        "sajda": false
      },
      {
        "number": 201,
        "text": "قتالكم -أيها المؤمنون- للمشركين في الشهر الذي حرَّم الله القتال فيه هو جزاء لقتالهم لكم في الشهر الحرام. والذي يعتدي على ما حَرَّم الله من المكان والزمان، يعاقب بمثل فعله، ومن جنس عمله. فمن اعتدى عليكم بالقتال أو غيره فأنزلوا به عقوبة مماثلة لجنايته، ولا حرج عليكم في ذلك؛ لأنهم هم البادئون بالعدوان، وخافوا الله فلا تتجاوزوا المماثلة في العقوبة، واعلموا أن الله مع الذين يتقونه ويطيعونه بأداء فرائضه وتجنب محارمه.",
        "surah": {
          "number": 2,
          "name": "سُورَةُ البَقَرَةِ",
          "englishName": "Al-Baqara",
          "englishNameTranslation": "The Cow",
          "revelationType": "Medinan",
          "numberOfAyahs": 286
        },
        "numberInSurah": 194,
        "juz": 2,
        "manzil": 1,
        "page": 30,
        "ruku": 25,
        "hizbQuarter": 12,
        "sajda": false
      },
      {
        "number": 202,
        "text": "واستمروا- أيها المؤمنون- في إنفاق الأموال لنصرة دين الله تعالى، والجهاد في سبيله، ولا توقعوا أنفسكم في المهالك بترك الجهاد في سبيل الله، وعدم الإنفاق فيه، وأحسنوا في الانفاق والطاعة، واجعلوا عملكم كله خالصًا لوجه الله تعالى. إن الله يحب أهل الإخلاص والإحسان.",
        "surah": {
          "number": 2,
          "name": "سُورَةُ البَقَرَةِ",
          "englishName": "Al-Baqara",
          "englishNameTranslation": "The Cow",
          "revelationType": "Medinan",
          "numberOfAyahs": 286
        },
        "numberInSurah": 195,
        "juz": 2,
        "manzil": 1,
        "page": 30,
        "ruku": 25,
        "hizbQuarter": 12,
        "sajda": false
      },
      {
        "number": 203,
        "text": "وأدُّوا الحج والعمرة تامَّيْنِ، خالصين لوجه الله تعالى. فإن منعكم عن الذهاب لإتمامهما بعد الإحرام بهما مانع كالعدو والمرض، فالواجب عليكم ذَبْحُ ما تيسر لكم من الإبل أو البقر أو الغنم تقربًا إلى الله تعالى؛ لكي تَخْرُجوا من إحرامكم بحلق شعر الرأس أو تقصيره، ولا تحلقوا رؤوسكم إذا كنتم محصرين حتى ينحر المحصر هديه في الموضع الذي حُصر فيه ثم يحل من إحرامه، كما نحر النبي صلى الله عليه وسلم في \"الحديبية\" ثم حلق رأسه، وغير المحصر لا ينحر الهدي إلا في الحرم، الذي هو محله في يوم العيد، اليوم العاشر وما بعده من أيام التشريق. فمن كان منكم مريضًا، أو به أذى من رأسه يحتاج معه إلى الحلق -وهو مُحْرِم- حَلَق، وعليه فدية: بأن يصوم ثلاثة أيام، أو يتصدق على ستة مساكين لكل مسكين نصف صاع من طعام، أو يذبح شاة لفقراء الحرم. فإذا كنتم في أمن وصحَّة: فمن استمتع بالعمرة إلى الحج وذلك باستباحة ما حُرِّم عليه بسبب الإحرام بعد انتهاء عمرته، فعليه ذبح ما تيسر من الهدي، فمن لم يجد هَدْيًا يذبحه فعليه صيام ثلاثة أيام في أشهر الحج، وسبعة إذا فرغتم من أعمال الحج ورجعتم إلى أهليكم، تلك عشرة كاملة لا بد من صيامها. ذلك الهَدْيُ وما ترتب عليه من الصيام لمن لم يكن أهله من ساكني أرض الحرم، وخافوا الله تعالى وحافظوا على امتثال أوامره واجتناب نواهيه، واعلموا أن الله شديد العقاب لمن خالف أمره، وارتكب ما عنه زجر.",
        "surah": {
          "number": 2,
          "name": "سُورَةُ البَقَرَةِ",
          "englishName": "Al-Baqara",
          "englishNameTranslation": "The Cow",
          "revelationType": "Medinan",
          "numberOfAyahs": 286
        },
        "numberInSurah": 196,
        "juz": 2,
        "manzil": 1,
        "page": 30,
        "ruku": 25,
        "hizbQuarter": 12,
        "sajda": false
      }
    ],
    "surahs": {
      "2": {
        "number": 2,
        "name": "سُورَةُ البَقَرَةِ",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      }
    },
    "edition": {
      "identifier": "ar.muyassar",
      "language": "ar",
      "name": "تفسير المیسر",
      "englishName": "King Fahad Quran Complex",
      "format": "text",
      "type": "tafsir",
      "direction": "rtl"
    }
  }
}