{
  "code": 200,
  "status": "OK",
  "data": {
    "number": 353,
    "ayahs": [
      {
        "number": 2819,
        "text": "فإن لم تجدوا في بيوت الآخرين أحدًا فلا تدخلوها حتى يوجد مَن يأذن لكم، فإن لم يأذن، بل قال لكم: ارجعوا فارجعوا، ولا تُلحُّوا، فإن الرجوع عندئذ أطهر لكم؛ لأن للإنسان أحوالا يكره اطلاع أحد عليها. والله بما تعملون عليم، فيجازي كل عامل بعمله.",
        "surah": {
          "number": 24,
          "name": "سُورَةُ النُّورِ",
          "englishName": "An-Noor",
          "englishNameTranslation": "The Light",
          "revelationType": "Medinan",
          "numberOfAyahs": 64
        },
        "numberInSurah": 28,
        "juz": 18,
        "manzil": 4,
        "page": 353,
        "ruku": 304,
        "hizbQuarter": 141,
        "sajda": false
      },
      {
        "number": 2820,
        "text": "لكن لا حرج عليكم أن تدخلوا بغير استئذان بيوتًا ليست مخصصة لسكنى أناس بذاتهم، بل ليتمتع بها مَن يحتاج إليها كالبيوت المُعَدَّة صدقة لابن السبيل في طرق المسافرين وغيرها من المرافق، ففيها منافع وحاجة لمن يدخلها، وفي الاستئذان مشقة. والله يعلم أحوالكم الظاهرة والخفية.",
        "surah": {
          "number": 24,
          "name": "سُورَةُ النُّورِ",
          "englishName": "An-Noor",
          "englishNameTranslation": "The Light",
          "revelationType": "Medinan",
          "numberOfAyahs": 64
        },
        "numberInSurah": 29,
        "juz": 18,
        "manzil": 4,
        "page": 353,
        "ruku": 304,
        "hizbQuarter": 141,
        "sajda": false
      },
      {
        "number": 2821,
        "text": "قل - أيها النبي - للمؤمنين يَغُضُّوا مِن أبصارهم عمَّا لا يحلُّ لهم من النساء والعورات، ويحفظوا فروجهم عمَّا حَرَّم الله من الزنى واللواط، وكشف العورات، ونحو ذلك، ذلك أطهر لهم. إن الله خبير بما يصنعون فيما يأمرهم به وينهاهم عنه.",
        "surah": {
          "number": 24,
          "name": "سُورَةُ النُّورِ",
          "englishName": "An-Noor",
          "englishNameTranslation": "The Light",
          "revelationType": "Medinan",
          "numberOfAyahs": 64
        },
        "numberInSurah": 30,
        "juz": 18,
        "manzil": 4,
        "page": 353,
        "ruku": 304,
        "hizbQuarter": 141,
        "sajda": false
      },
      {
        "number": 2822,
        "text": "وقل للمؤمنات يغضضن من أبصارهن عمَّا لا يحلُّ لهن من العورات، ويحفظن فروجهن عمَّا حَرَّم الله، ولا يُظهرن زينتهن للرجال، بل يجتهدن في إخفائها إلا الثياب الظاهرة التي جرت العادة بلُبْسها، إذا لم يكن في ذلك ما يدعو إلى الفتنة بها، وليلقين بأغطية رؤوسهن على فتحات صدورهن مغطيات وجوههن؛ ليكمل سترهن، ولا يُظْهِرْنَ الزينة الخفية إلا لأزواجهن؛ إذ يرون منهن ما لا يرى غيرهم. وبعضها، كالوجه، والعنق، واليدين، والساعدين يباح رؤيته لآبائهن أو آباء أزواجهن أو أبنائهن أو أبناء أزواجهن أو إخوانهن أو أبناء إخوانهن أو أبناء أخواتهن أو نسائهن المسلمات دون الكافرات، أو ما ملكن مِنَ العبيد، أو التابعين من الرجال الذين لا غرض ولا حاجة لهم في النساء، مثل البُلْه الذين يتبعون غيرهم للطعام والشراب فحسب، أو الأطفال الصغار الذين ليس لهم علم بأمور عورات النساء، ولم توجد فيهم الشهوة بعد، ولا يضرب النساء عند سَيْرهن بأرجلهن ليُسْمِعْن صوت ما خفي من زينتهن كالخلخال ونحوه، وارجعوا- أيها المؤمنون- إلى طاعة الله فيما أمركم به من هذه الصفات الجميلة والأخلاق الحميدة، واتركوا ما كان عليه أهل الجاهلية من الأخلاق والصفات الرذيلة؛ رجاء أن تفوزوا بخيري الدنيا والآخرة.",
        "surah": {
          "number": 24,
          "name": "سُورَةُ النُّورِ",
          "englishName": "An-Noor",
          "englishNameTranslation": "The Light",
          "revelationType": "Medinan",
          "numberOfAyahs": 64
        },
        "numberInSurah": 31,
        "juz": 18,
        "manzil": 4,
        "page": 353,
        "ruku": 304,
        "hizbQuarter": 141,
        "sajda": false
      }
    ],
    "surahs": {
      "24": {
        "number": 24,
        "name": "سُورَةُ النُّورِ",
        "englishName": "An-Noor",
        "englishNameTranslation": "The Light",
        "revelationType": "Medinan",
        "numberOfAyahs": 64
      }
    },
    "edition": {
      "identifier": "ar.muyassar",
      "language": "ar",
      "name": "تفسير المیسر",
      "englishName": "King Fahad Quran Complex",
      "format": "text",
      "type": "tafsir",
      "direction": "rtl"
    }
  }
}