{
  "code": 200,
  "status": "OK",
  "data": {
    "number": 42,
    "ayahs": [
      {
        "number": 260,
        "text": "هؤلاء الرسل الكرام فضَّل الله بعضهم على بعض، بحسب ما منَّ الله به عليهم: فمنهم مَن كلمه الله كموسى ومحمد عليهما الصلاة والسلام، وفي هذا إثبات صفة الكلام لله عز وجل على الوجه اللائق بجلاله، ومنهم مَن رفعه الله درجاتٍ عاليةً كمحمد صلى الله عليه وسلم، بعموم رسالته، وختم النبوة به، وتفضيل أمته على جميع الأمم، وغير ذلك. وآتى الله تعالى عيسى ابن مريم عليه السلام البينات المعجزات الباهرات، كإبراء مَن ولد أعمى بإذن الله تعالى، ومَن به برص بإذن الله، وكإحيائه الموتى بإذن الله، وأيده بجبريل عليه السلام. ولو شاء الله ألا يقتتل الذين جاؤوا مِن بعد هؤلاء الرسل مِن بعد ما جاءتهم البينات ما اقتتلوا، ولكن وقع الاختلاف بينهم: فمنهم مَن ثبت على إيمانه، ومنهم مَن أصر على كفره. ولو شاء الله بعد ما وقع الاختلاف بينهم، الموجب للاقتتال، ما اقتتلوا، ولكن الله يوفق مَن يشاء لطاعته والإيمان به، ويخذل مَن يشاء، فيعصيه ويكفر به، فهو يفعل ما يشاء ويختار.",
        "surah": {
          "number": 2,
          "name": "سُورَةُ البَقَرَةِ",
          "englishName": "Al-Baqara",
          "englishNameTranslation": "The Cow",
          "revelationType": "Medinan",
          "numberOfAyahs": 286
        },
        "numberInSurah": 253,
        "juz": 3,
        "manzil": 1,
        "page": 42,
        "ruku": 34,
        "hizbQuarter": 17,
        "sajda": false
      },
      {
        "number": 261,
        "text": "يا من آمنتم بالله وصدَّقتم رسوله وعملتم بهديه أخرجوا الزكاة المفروضة، وتصدَّقوا مما أعطاكم الله قبل مجيء يوم القيامة حين لا بيع فيكون ربح، ولا مال تفتدون به أنفسكم مِن عذاب الله، ولا صداقة صديق تُنقذكم، ولا شافع يملك تخفيف العذاب عنكم. والكافرون هم الظالمون المتجاوزون حدود الله.",
        "surah": {
          "number": 2,
          "name": "سُورَةُ البَقَرَةِ",
          "englishName": "Al-Baqara",
          "englishNameTranslation": "The Cow",
          "revelationType": "Medinan",
          "numberOfAyahs": 286
        },
        "numberInSurah": 254,
        "juz": 3,
        "manzil": 1,
        "page": 42,
        "ruku": 35,
        "hizbQuarter": 17,
        "sajda": false
      },
      {
        "number": 262,
        "text": "الله الذي لا يستحق الألوهية والعبودية إلا هو، الحيُّ الذي له جميع معاني الحياة الكاملة كما يليق بجلاله، القائم على كل شيء، لا تأخذه سِنَة أي: نعاس، ولا نوم، كل ما في السماوات وما في الأرض ملك له، ولا يتجاسر أحد أن يشفع عنده إلا بإذنه، محيط علمه بجميع الكائنات ماضيها وحاضرها ومستقبلها، يعلم ما بين أيدي الخلائق من الأمور المستقبلة، وما خلفهم من الأمور الماضية، ولا يَطَّلعُ أحد من الخلق على شيء من علمه إلا بما أعلمه الله وأطلعه عليه. وسع كرسيه السماوات والأرض، والكرسي: هو موضع قدمي الرب -جل جلاله- ولا يعلم كيفيته إلا الله سبحانه، ولا يثقله سبحانه حفظهما، وهو العلي بذاته وصفاته على جميع مخلوقاته، الجامع لجميع صفات العظمة والكبرياء. وهذه الآية أعظم آية في القرآن، وتسمى: (آية الكرسي).",
        "surah": {
          "number": 2,
          "name": "سُورَةُ البَقَرَةِ",
          "englishName": "Al-Baqara",
          "englishNameTranslation": "The Cow",
          "revelationType": "Medinan",
          "numberOfAyahs": 286
        },
        "numberInSurah": 255,
        "juz": 3,
        "manzil": 1,
        "page": 42,
        "ruku": 35,
        "hizbQuarter": 17,
        "sajda": false
      },
      {
        "number": 263,
        "text": "لكمال هذا الدين واتضاح آياته لا يُحتاج إلى الإكراه عليه لمن تُقبل منهم الجزية، فالدلائل بينة يتضح بها الحق من الباطل، والهدى من الضلال. فَمَن يكفر بكل ما عُبِد من دون الله ويؤمن بالله، فقد ثبت واستقام على الطريقة المثلى، واستمسك من الدين بأقوى سبب لا انقطاع له. والله سميع لأقوال عباده، عليم بأفعالهم ونياتهم، وسيجازيهم على ذلك.",
        "surah": {
          "number": 2,
          "name": "سُورَةُ البَقَرَةِ",
          "englishName": "Al-Baqara",
          "englishNameTranslation": "The Cow",
          "revelationType": "Medinan",
          "numberOfAyahs": 286
        },
        "numberInSurah": 256,
        "juz": 3,
        "manzil": 1,
        "page": 42,
        "ruku": 35,
        "hizbQuarter": 17,
        "sajda": false
      }
    ],
    "surahs": {
      "2": {
        "number": 2,
        "name": "سُورَةُ البَقَرَةِ",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      }
    },
    "edition": {
      "identifier": "ar.muyassar",
      "language": "ar",
      "name": "تفسير المیسر",
      "englishName": "King Fahad Quran Complex",
      "format": "text",
      "type": "tafsir",
      "direction": "rtl"
    }
  }
}