{
  "code": 200,
  "status": "OK",
  "data": {
    "number": 93,
    "ayahs": [
      {
        "number": 585,
        "text": "ولا يحق لمؤمن الاعتداء على أخيه المؤمن وقتله بغير حق، إلا أن يقع منه ذلك على وجه الخطأ الذي لا عمد فيه، ومن وقع منه ذلك الخطأ فعليه عتق رقبة مؤمنة، وتسليم دية مقدرة إلى أوليائه، إلا أن يتصدقوا بها عليه ويعفوا عنه. فإن كان المقتول من قوم كفار أعداء للمؤمنين، وهو مؤمن بالله تعالى، وبما أنزل من الحق على رسوله محمد صلى الله عليه وسلم، فعلى قاتله عتق رقبة مؤمنة، وإن كان من قوم بينكم وبينهم عهد وميثاق، فعلى قاتله دية تسلم إلى أوليائه وعتق رقبة مؤمنة، فمن لم يجد القدرة على عتق رقبة مؤمنة، فعليه صيام شهرين متتابعين؛ ليتوب الله تعالى عليه. وكان الله تعالى عليما بحقيقة شأن عباده، حكيمًا فيما شرعه لهم.",
        "surah": {
          "number": 4,
          "name": "سُورَةُ النِّسَاءِ",
          "englishName": "An-Nisaa",
          "englishNameTranslation": "The Women",
          "revelationType": "Medinan",
          "numberOfAyahs": 176
        },
        "numberInSurah": 92,
        "juz": 5,
        "manzil": 1,
        "page": 93,
        "ruku": 74,
        "hizbQuarter": 37,
        "sajda": false
      },
      {
        "number": 586,
        "text": "ومن يَعْتَدِ على مؤمن فيقتله عن عمد بغير حق فعاقبته جهنم، خالدًا فيها مع سخط الله تعالى عليه وطَرْدِهِ من رحمته، إن جازاه على ذنبه وأعدَّ الله له أشد العذاب بسبب ما ارتكبه من هذه الجناية العظيمة. ولكنه سبحانه يعفو ويتفضل على أهل الإيمان فلا يجازيهم بالخلود في جهنم.",
        "surah": {
          "number": 4,
          "name": "سُورَةُ النِّسَاءِ",
          "englishName": "An-Nisaa",
          "englishNameTranslation": "The Women",
          "revelationType": "Medinan",
          "numberOfAyahs": 176
        },
        "numberInSurah": 93,
        "juz": 5,
        "manzil": 1,
        "page": 93,
        "ruku": 74,
        "hizbQuarter": 37,
        "sajda": false
      },
      {
        "number": 587,
        "text": "يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه إذا خرجتم في الأرض مجاهدين في سبيل الله فكونوا على بينة مما تأتون وتتركون، ولا تنفوا الإيمان عمن بدا منه شيء من علامات الإسلام ولم يقاتلكم؛ لاحتمال أن يكون مؤمنًا يخفي إيمانه، طالبين بذلك متاع الحياة الدنيا، والله تعالى عنده من الفضل والعطاء ما يغنيكم به، كذلك كنتم في بدء الإسلام تخفون إيمانكم عن قومكم من المشركين فمَنَّ الله عليكم، وأعزَّكم بالإيمان والقوة، فكونوا على بيِّنة ومعرفة في أموركم. إن الله تعالى عليم بكل أعمالكم، مطَّلع على دقائق أموركم، وسيجازيكم عليها.",
        "surah": {
          "number": 4,
          "name": "سُورَةُ النِّسَاءِ",
          "englishName": "An-Nisaa",
          "englishNameTranslation": "The Women",
          "revelationType": "Medinan",
          "numberOfAyahs": 176
        },
        "numberInSurah": 94,
        "juz": 5,
        "manzil": 1,
        "page": 93,
        "ruku": 74,
        "hizbQuarter": 37,
        "sajda": false
      }
    ],
    "surahs": {
      "4": {
        "number": 4,
        "name": "سُورَةُ النِّسَاءِ",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      }
    },
    "edition": {
      "identifier": "ar.muyassar",
      "language": "ar",
      "name": "تفسير المیسر",
      "englishName": "King Fahad Quran Complex",
      "format": "text",
      "type": "tafsir",
      "direction": "rtl"
    }
  }
}