Repository: alabdouadam-ship-it/qurani
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# reciterLabel
source: Reciter: {name}
ar: القارئ: {name}
fr: Récitateur : {name}

# verseAudiosDownloaded
source: Verse audios downloaded: {count} (total ~6236)
ar: تلاوات الآيات المحمّلة: {count} (الإجمالي ~6236)
fr: Audios des versets téléchargés : {count} (total ~6236)

# fullSurahsDownloaded
source: Full surahs downloaded: {count} / 114
ar: السور الكاملة المحمّلة: {count} / 114
fr: Sourates complètes téléchargées : {count} / 114

# downloadWhy
source: Why download? You can listen without internet.
ar: لماذا التحميل؟ لتستمع بدون إنترنت.
fr: Pourquoi télécharger ? Pour écouter sans internet.

# downloadingProgress
source: Downloading {current} / {total}
ar: جاري التنزيل {current} / {total}
fr: Téléchargement {current} / {total}

source: Download verse audios
ar: تنزيل تلاوات الآيات
fr: Télécharger les audios des versets

source: Delete verse audios
ar: حذف تلاوات الآيات
fr: Supprimer les audios des versets

source: Download full surahs
ar: تنزيل السور الكاملة
fr: Télécharger les sourates complètes

source: Delete full surahs
ar: حذف السور الكاملة
fr: Supprimer les sourates complètes

# fullSurahLabel
source: Full surahs
ar: السور الكاملة
fr: Sourates complètes

# downloadFullSurahNote
source: Note: Full surah audio can be downloaded from Listen to Quran screen.
ar: ملاحظة: يمكن تنزيل تلاوة السورة كاملة من شاشة الاستماع للقرآن.
fr: Note : L'audio des sourates complètes peut être téléchargé depuis l'écran Écouter le Coran.

source: Name
ar: الاسم
fr: Nom

source: Enter your name
ar: أدخل اسمك
fr: Entrez votre nom

# timeFormatTitle
source: Time format
ar: تنسيق الوقت
fr: Format de l'heure

# twelveHour
source: 12h
ar: ‏12 ساعة

# twentyFourHour
source: 24h
ar: ‏24 ساعة

# homeGreetingGeneric
source: Welcome to Qurani App
ar: أهلا بك في تطبيق قرآني
fr: Bienvenue sur l'application Qurani

# homeGreetingNamed
source: Welcome {userName} to Qurani App
ar: أهلا بك يا {userName} في تطبيق قرآني
fr: Bienvenue {userName} sur l'application Qurani

# hijriHeader
source: Hijri
ar: هجري
fr: Hégirien

# gregorianHeader
source: Gregorian
ar: ميلادي
fr: Grégorien

# audioInternetRequired
source: No internet connection. Please connect to play audio or download offline files.
ar: لا يوجد اتصال بالإنترنت. يرجى الاتصال لتشغيل الصوت أو تنزيل الملفات.
fr: Pas de connexion Internet. Veuillez vous connecter pour lire l’audio ou télécharger les fichiers.

# editionArabicSimple
source: Arabic (Simple)
ar: العربية (بسيط)
fr: Arabe (Simple)

# editionArabicUthmani
source: Arabic (Uthmani)
ar: العربية (عثماني)
fr: Arabe (Othmani)

# editionArabicTajweed
source: Quran Tajweed
ar: القرآن المجود

# editionEnglish
source: English
ar: الإنجليزية
fr: Anglais

# editionFrench
source: French
ar: الفرنسية
fr: Français

# editionTafsir
source: Tafsir (Muyassar)
ar: التفسير (الميسّر)

source: Why contact us?
ar: لماذا تتصل بنا؟
fr: Pourquoi nous contacter ?

# reportBugTitle
source: Report bugs & request features
ar: الإبلاغ عن الأخطاء و طلب الميزات
fr: Signaler des bugs et demander des fonctionnalités

# reportBugDesc
source: Tell us about bugs, problems, or features you'd like us to add in future versions
ar: أخبرنا عن الأخطاء والمشاكل أو الميزات التي تريد إضافتها في الإصدارات القادمة
fr: Dites-nous les bugs, les problèmes ou les fonctionnalités que vous aimeriez dans les versions futures

# supportUsTitle
source: Support our project
ar: ادعم مشروعنا
fr: Soutenir notre projet

# supportUsDesc
source: Your support helps the application continue to work and benefit the Muslim community worldwide
ar: دعمك يساعد التطبيق على الاستمرار في العمل والعمل لصالح المسلمين حول العالم
fr: Votre soutien aide l'application à continuer de fonctionner et de bénéficier à la communauté musulmane mondiale

# shareIdeaTitle
source: Share your ideas
ar: شارك أفكارك
fr: Partagez vos idées

# shareIdeaDesc
source: Do you have an idea for a website, mobile app, or any tech project? Share your idea with us, and we will help you turn it into a real project.
ar: هل لديك فكرة لموقع إلكتروني أو تطبيق جوال أو أي مشروع تقني؟ شاركنا فكرتك، وسنساعدك في تحويلها إلى مشروع حقيقي
fr: Avez-vous une idée pour un site web, une application mobile ou tout autre projet technologique ? Partagez-la avec nous, et nous vous aiderons à la transformer en un projet réel.

source: Get in touch
ar: تواصل معنا
fr: Nous contacter

# readAutoFlip
source: Auto flip page
ar: قلب الصفحة تلقائياً
fr: Tourner automatiquement la page

# readAutoFlipDesc
source: Automatically turn the page when audio ends.
ar: الانتقال للصفحة التالية عند انتهاء التلاوة.
fr: Tourner automatiquement la page lorsque l'audio se termine.

source: Choose reciter
ar: اختر القارئ
fr: Choisir le récitateur

# chooseReciterDesc
source: Select your preferred reciter.
ar: اختر القارئ المفضل لديك.
fr: Sélectionnez votre récitateur préféré.

source: Reciter not compatible
ar: القارئ غير متوافق
fr: Récitateur non compatible

# reciterNotAvailableForFullSurahs
source: Full surah audio files are not available for this reciter. Please choose another reciter.
ar: الملفات الصوتية للسور الكاملة غير متوفرة لهذا القارئ. يرجى اختيار قارئ آخر.
fr: Les fichiers audio des sourates complètes ne sont pas disponibles pour ce récitateur. Veuillez choisir un autre récitateur.

# reciterNotAvailableForVerses
source: Verse-by-verse audio files are not available for reciter {reciterName}. Please choose another reciter.
ar: الملفات الصوتية (آية بآية) غير متوفرة للقارئ {reciterName}. يرجى اختيار قارئ آخر.
fr: Les fichiers audio verset par verset ne sont pas disponibles pour le récitateur {reciterName}. Veuillez choisir un autre récitateur.

source: Range repeat count
ar: عدد تكرار النطاق
fr: Nombre de répétitions de la plage

source: Start at last page
ar: البدء من آخر صفحة
fr: Commencer à la dernière page

# startAtLastPageDesc
source: If enabled, resume reading from the last page you visited.
ar: عند التفعيل، يتم استئناف القراءة من آخر صفحة تم الوصول إليها.
fr: Si activé, reprendre la lecture à la dernière page visitée.

source: Always Start from Beginning
ar: ابدأ دائماً من البداية
fr: Toujours commencer au début

# alwaysStartFromBeginningDesc
source: When enabled, always start playing from the first verse. When disabled, resume from last position.
ar: عند التفعيل، يبدأ التشغيل دائماً من أول آية. عند التعطيل، يستأنف من آخر موضع.
fr: Si activé, la lecture commence toujours au premier verset. Si désactivé, elle reprend à la dernière position.

source: Downloading Mushaf...
ar: جاري تنزيل المصحف...
fr: Téléchargement du Mushaf...

source: Download Mushaf PDF
ar: تنزيل مصحف PDF
fr: Télécharger le PDF du Mushaf

# chooseStyleToDownload
source: Choose a style to download:
ar: اختر نمطًا للتنزيل:
fr: Choisissez un style à télécharger :

source: Return to Text View
ar: العودة للعرض النصي
fr: Retour à la vue texte

# errorLoadingPdf
source: Error loading PDF file
ar: خطأ في تحميل ملف PDF
fr: Erreur de chargement du fichier PDF

source: Delete and Retry
ar: حذف وإعادة المحاولة
fr: Supprimer et réessayer

# mushafTypeBlue
source: Blue Mushaf (Shamarly)
ar: النسخة الزرقاء
fr: Mushaf Bleu (Shamarly)

# mushafTypeGreen
source: Green Mushaf
ar: النسخة الخضراء
fr: Mushaf Vert

# mushafTypeTajweed
source: Tajweed Mushaf
ar: النسخة المجودة
fr: Mushaf Tajwid

source: Mushaf Style
ar: نوع المصحف
fr: Style de Mushaf

source: All Quran
ar: كل القرآن
fr: Tout le Coran

# filterBySurah
source: Surah
ar: السورة
fr: Sourate

source: Download Confirmation
ar: تأكيد التحميل

# downloadConfirmationMsg
source: Do you want to download {mushafName}?
ar: هل تريد تحميل {mushafName}؟

# downloadFailedReverting
source: Download failed, reverting to previous edition.
ar: فشل التحميل، جاري العودة للنسخة السابقة.

source: Bookmark page
ar: حفظ الصفحة

source: Remove bookmark
ar: إزالة الحفظ

# noBookmarks
source: No bookmarks yet
ar: لا توجد إشارات مرجعية بعد

# colorDefault
source: Default (Cream)
ar: افتراضي (كريمي)

# colorRed
source: Red
ar: أحمر

# colorBlue
source: Blue
ar: أزرق

# colorGreen
source: Green
ar: أخضر
