Repository: alabdouadam-ship-it/qurani
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Settings
ar: الإعدادات
fr: Paramètres

source: Qurani Settings
ar: إعدادات قراني
fr: Paramètres Qurani

source: Customize your experience
ar: خصص تجربتك
fr: Personnalisez votre expérience

source: About
ar: حول
fr: À propos

source: App information
ar: معلومات التطبيق
fr: Informations sur l'application

source: Help
ar: مساعدة
fr: Aide

source: Get assistance
ar: احصل على المساعدة
fr: Obtenir de l'assistance

source: Preferences
ar: التفضيلات
fr: Préférences

source: Quran preferences
ar: تفضيلات القرآن
fr: Préférences du Coran

source: Share App
ar: مشاركة التطبيق
fr: Partager l'application

# shareAppMessage
source: Discover Qurani, the app that helps you engage with the Holy Quran: listening, reading, repetition-based memorization, digital tasbeeh, Qibla direction, memorization tests, and more. The app supports Arabic, English and French, with multiple color themes. Get it on Google Play: {appUrl}
ar: اكتشف تطبيق قرآني الذي يساعدك على التفاعل مع القرآن الكريم: استماع وقراءة وحفظ بالتكرار، مسبحة إلكترونية، تحديد اتجاه القبلة، اختبار الحفظ والمزيد. يدعم التطبيق العربية والإنجليزية والفرنسية ويتيح واجهات بألوان متعددة حسب الرغبة. حمّله الآن من جوجل بلاي: {appUrl}
fr: Découvrez Qurani, l’application qui vous aide à interagir avec le Coran : écoute, lecture, mémorisation par répétition, tasbih numérique, direction de la qibla, tests de mémorisation et plus encore. L’application prend en charge l’arabe, l’anglais et le français, avec plusieurs thèmes de couleurs. Téléchargez-la sur Google Play : {appUrl}

source: Tell others
ar: أخبر الآخرين
fr: Parlez-en aux autres

# updateAvailable
source: A new version of Qurani is available
ar: إصدار جديد من قرآني متوفر
fr: Une nouvelle version de Qurani est disponible

# updateNow
source: Update
ar: تحديث
fr: Mettre à jour

source: Later
ar: لاحقًا
fr: Plus tard

source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

source: Terms & Conditions
ar: الشروط والأحكام
fr: Conditions générales

source: Support us
ar: ادعمنا
fr: Soutenez-nous

source: Contact us
ar: تواصل معنا
fr: Contactez-nous

# supportIntro
source: We rely on hosting and third‑party services to keep Qurani running. Your optional support helps sustain and improve the app.
ar: نعتمد على الاستضافة وخدمات خارجية لضمان استمرار تطبيق قرآني. دعمكم الاختياري يساعدنا على الاستمرار وتطوير التطبيق.
fr: Nous dépendons de l’hébergement et de services tiers pour assurer la disponibilité de Qurani. Votre soutien facultatif nous aide à maintenir et améliorer l’application.

source: Donate via PayPal
ar: التبرع عبر باي بال
fr: Don via PayPal

source: PayPal email
ar: بريد باي بال
fr: Email PayPal

# donateViaCrypto
source: Donate via USDT
ar: التبرع عبر USDT
fr: Don via USDT

source: USDT address
ar: عنوان USDT
fr: Adresse USDT

# watchAd
source: Support by watching an ad (coming soon)
ar: ادعمنا بمشاهدة إعلان (قريبًا)
fr: Soutenir en regardant une publicité (bientôt)

# contactViaWhatsApp
source: WhatsApp
ar: واتساب

# contactViaEmail
source: Email
ar: البريد الإلكتروني

# contactViaWhatsAppGroup
source: WhatsApp Group
ar: مجموعة واتساب
fr: Groupe WhatsApp

source: Copy
ar: نسخ
fr: Copier

source: Copied
ar: تم النسخ
fr: Copié

source: Prayer Times
ar: أوقات الصلاة
fr: Heures de prière

source: Fajr
ar: الفجر

source: Sunrise
ar: الشروق
fr: Lever du soleil

source: Dhuhr
ar: الظهر

source: Asr
ar: العصر

source: Maghrib
ar: المغرب

source: Isha
ar: العشاء

# adhanEnabledMsg
source: Adhan will play at this prayer time.
ar: سيتم تشغيل الأذان في وقت هذه الصلاة.
fr: L'adhan sera diffusé à cette heure de prière.

# adhanDisabledMsg
source: Adhan will not play at this prayer time.
ar: لن يتم تشغيل الأذان في وقت هذه الصلاة.
fr: L'adhan ne sera pas diffusé à cette heure de prière.

source: Stop Adhan
ar: إيقاف الأذان
fr: Arrêter l'adhan

# adhanStoppedMsg
source: Adhan stopped
ar: تم إيقاف الأذان
fr: Adhan arrêté

source: Adjust time
ar: تصحيح الوقت
fr: Ajuster l'heure

# prayerAdjustmentTooltip
source: Adjust prayer time
ar: معايرة وقت الصلاة
fr: Ajuster l'heure de la prière

# prayerAdjustmentTitle
source: Adjust {prayerName} time
ar: معايرة وقت {prayerName}
fr: Ajuster l'heure de {prayerName}

# prayerAdjustmentOriginal
source: Original time
ar: الوقت الأصلي
fr: Heure d'origine

# shareSurahMessage
source: Listen to {surahName} by {reciterName}: {url}
ar: استمع إلى {surahName} بصوت {reciterName}: {url}

source: Share Ayah
ar: مشاركة الآية

# shareAudio
source: Share Audio Link
ar: مشاركة رابط الصوت

source: Share Text
ar: مشاركة كنص

source: Share Image
ar: مشاركة كصورة

# prayerAdjustmentChange
source: Adjustment: {value}
ar: التعديل: {value}
fr: Ajustement : {value}

# prayerAdjustmentAfter
source: After adjustment: {time}
ar: بعد التعديل: {time}
fr: Après ajustement : {time}

# prayerAdjustmentNoChange
source: No adjustment
ar: لا يوجد تعديل
fr: Aucun ajustement

# prayerAdjustmentReset
source: Reset adjustment
ar: إعادة تعيين التعديل
fr: Réinitialiser l'ajustement

# plus10Min
source: +10 min
ar: +10 دقائق

# minus10Min
source: -10 min
ar: -10 دقائق

# plus1Min
source: +1 min
ar: +1 دقيقة

# minus1Min
source: -1 min
ar: -1 دقيقة

source: Advanced options
ar: خيارات متقدمة
fr: Options avancées

source: Calculation method
ar: طريقة الحساب
fr: Méthode de calcul

# methodMWL
source: Muslim World League
ar: رابطة العالم الإسلامي
fr: Ligue du Monde Musulman

# methodUmmAlQura
source: Umm Al-Qura (Makkah)
ar: أم القرى (مكة)
fr: Oumm al-Qura (La Mecque)

# methodEgyptian
source: Egyptian General Authority
ar: الهيئة العامة المصرية
fr: Autorité générale égyptienne

# apiUnavailableUsingLocal
source: Online service unavailable. Using local calculation.
ar: الخدمة عبر الإنترنت غير متاحة. سيتم استخدام الحساب المحلي.
fr: Service en ligne indisponible. Utilisation du calcul local.

# prayerMethodSectionTitle
source: Prayer Time Calculation Method
ar: طريقة حساب أوقات الصلاة
fr: Méthode de calcul des heures de prière

# prayerMethodSectionDesc
source: Choose your preferred method or leave it automatic based on your location
ar: اختر الطريقة المفضلة لديك أو اترك الخيار التلقائي حسب موقعك
fr: Choisissez votre méthode préférée ou laissez-la automatique selon votre emplacement

# prayerMethodAuto
source: Automatic (based on location)
ar: تلقائي (حسب الموقع)
fr: Automatique (selon l'emplacement)

# prayerMethodChanged
source: Updating prayer times...
ar: جاري تحديث أوقات الصلاة...
fr: Mise à jour des heures de prière...

# prayerMethodChangedDesc
source: Calculation method changed, updating times
ar: تم تغيير طريقة الحساب، جاري تحديث الأوقات
fr: Méthode de calcul modifiée, mise à jour des heures

# method0
source: Shia Ithna-Ashari, Leva Institute, Qum
ar: الشيعة الإثنا عشرية - معهد ليفا، قم
fr: Chiite Ithna-Ashari, Institut Leva, Qom

# method1
source: University of Islamic Sciences, Karachi
ar: جامعة العلوم الإسلامية، كراتشي
fr: Université des Sciences Islamiques, Karachi

# method2
source: Islamic Society of North America (ISNA)
ar: الجمعية الإسلامية لأمريكا الشمالية
fr: Société Islamique d'Amérique du Nord (ISNA)

# method3
source: Muslim World League
ar: رابطة العالم الإسلامي
fr: Ligue du Monde Musulman

# method4
source: Umm Al-Qura University, Makkah
ar: جامعة أم القرى، مكة المكرمة
fr: Université Oumm al-Qura, La Mecque

# method5
source: Egyptian General Authority of Survey
ar: الهيئة المصرية العامة للمساحة
fr: Autorité Générale Égyptienne d'Arpentage

# method7
source: Institute of Geophysics, University of Tehran
ar: معهد الجيوفيزياء، جامعة طهران
fr: Institut de Géophysique, Université de Téhéran

# method8
source: Gulf Region
ar: منطقة الخليج
fr: Région du Golfe

# method9
source: Kuwait
ar: الكويت
fr: Koweït

# method10
source: Qatar
ar: قطر

# method11
source: Majlis Ugama Islam Singapura, Singapore
ar: مجلس الشؤون الإسلامية، سنغافورة
fr: Majlis Ugama Islam Singapura, Singapour

# method12
source: Union Organization Islamic de France
ar: الاتحاد الإسلامي لفرنسا
fr: Union des Organisations Islamiques de France

# method13
source: Diyanet İşleri Başkanlığı, Turkey
ar: رئاسة الشؤون الدينية، تركيا
fr: Diyanet İşleri Başkanlığı, Turquie

# method14
source: Spiritual Administration of Muslims of Russia
ar: الإدارة الروحية لمسلمي روسيا
fr: Administration Spirituelle des Musulmans de Russie

# method15
source: Moonsighting Committee Worldwide
ar: لجنة رؤية الهلال العالمية
fr: Comité Mondial d'Observation du Croissant

# method16
source: Dubai
ar: دبي
fr: Dubaï

# method17
source: Jabatan Kemajuan Islam Malaysia (JAKIM)
ar: دائرة التقدم الإسلامي، ماليزيا

# method18
source: Tunisia
ar: تونس
fr: Tunisie

# method19
source: Algeria
ar: الجزائر
fr: Algérie

# method20
source: Kementerian Agama Republik Indonesia
ar: وزارة الشؤون الدينية، إندونيسيا
fr: Ministère des Affaires Religieuses, Indonésie

# method21
source: Morocco
ar: المغرب
fr: Maroc

# method22
source: Comunidade Islamica de Lisboa
ar: الجالية الإسلامية في لشبونة
fr: Communauté Islamique de Lisbonne

# method23
source: Ministry of Awqaf, Islamic Affairs and Holy Places, Jordan
ar: وزارة الأوقاف والشؤون الإسلامية، الأردن
fr: Ministère des Waqfs et des Affaires Islamiques, Jordanie

source: Prayer times settings
ar: إعدادات أوقات الصلاة
fr: Paramètres des heures de prière

source: Adhan sound
ar: صوت الأذان
fr: Son de l'adhan

# adhanSoundOption1
source: Adhan 1
ar: أذان 1

# adhanSoundOption2
source: Adhan 2
ar: أذان 2

# adhanSoundOption3
source: Adhan 3
ar: أذان 3

source: Data protection
ar: حماية البيانات
fr: Protection des données

# aboutTitle
source: About Qurani
ar: حول قرآني
fr: À propos de Qurani

# aboutDescription
source: Qurani helps you engage with the Holy Quran: listening, reading, repetition-based memorization, digital tasbeeh, Qibla direction, memorization tests, bookmarks, featured verses, and more. Supports Arabic, English, and French, with customizable themes and fonts.
ar: يساعدك تطبيق قرآني على التفاعل مع القرآن الكريم: الاستماع والقراءة والحفظ بالتكرار، مسبحة إلكترونية، تحديد اتجاه القبلة، اختبارات الحفظ، العلامات، الآيات المميزة والمزيد. يدعم التطبيق العربية والإنجليزية والفرنسية مع إمكانية تخصيص الألوان والخطوط.
fr: Qurani vous aide à interagir avec le Coran : écoute, lecture, mémorisation par répétition, tasbih numérique, direction de la qibla, tests de mémorisation, favoris, versets mis en avant et plus encore. L’application prend en charge l’arabe, l’anglais et le français, avec des thèmes et polices personnalisables.

# appVersionLabel
source: Version: {version}
ar: الإصدار: {version}

# optionsTitle
source: My Quran
ar: قرآني
fr: Mon coran

# quraniFeatures
source: What do you want to do?
ar: ماذا تريد أن تفعل؟
fr: Que voulez vous faire?

source: Additional features and tools
ar: ميزات وأدوات إضافية
fr: Fonctionnalités et outils supplémentaires

source: Bookmarks
ar: الإشارات المرجعية
fr: Marque-pages

source: Saved verses
ar: الآيات المحفوظة
fr: Versets sauvegardés

source: History
ar: السجل
fr: Historique

source: Recent activity
ar: النشاط الأخير
fr: Activité récente

source: Favorites
ar: المفضلة
fr: Favoris

source: Liked content
ar: المحتوى المفضل
fr: Contenu aimé

source: Downloads
ar: التحميلات
fr: Téléchargements

source: Offline content
ar: المحتوى دون اتصال
fr: Contenu hors ligne

source: Memorization Test
ar: اختبار الحفظ
fr: Test de mémorisation

# memorizationTestSubtitle
source: Test your memorization
ar: اختبر حفظك
fr: Testez votre mémorisation

source: Repetition Memorization
ar: الحفظ بالتكرار
fr: Mémorisation par répétition

# searchQuran
source: Search in quran
ar: البحث في القرآن
fr: ٌRechercher dans le Coran

# listenQuran
source: Listen to Quran
ar: استمع إلى القرآن
fr: Écouter le Coran

# readQuran
source: Read the Quran
ar: اقرأ القرآن
fr: Lire le Coran

source: Hadith
ar: حديث

source: Tasbeeh
ar: المسبحة

source: verses
ar: آيات
fr: versets

# pleaseSelectSurah
source: Select a surah
ar: اختر سورة
fr: Sélectionner une sourate

# surahTranslationsNote
source: Names are shown in your selected language
ar: يتم عرض الأسماء باللغة المختارة
fr: Les noms sont affichés dans votre langue sélectionnée

source: Search surah...
ar: ابحث عن سورة...
fr: Rechercher une sourate...

# repeatSurah
source: Repeat
ar: تكرار
fr: Répéter

source: Auto-advance
ar: التقدم التلقائي
fr: Avance automatique

source: References
ar: المراجع
fr: Références

source: Quran References
ar: مراجع القرآن
fr: Références du Coran

source: Customize your reading preferences
ar: خصص تفضيلات القراءة الخاصة بك
fr: Personnalisez vos préférences de lecture

source: Quran Version
ar: نسخة القرآن
fr: Version du Coran

source: Reciter
ar: القارئ
fr: Récitateur

source: Repetition Reciter
ar: قارئ التكرار
fr: Récitateur de répétition

source: Theme
ar: المظهر
fr: Thème

source: Language
ar: اللغة
fr: Langue

source: Tafsir
ar: التفسير

source: Save Preferences
ar: حفظ التفضيلات
fr: Enregistrer les préférences

source: Preferences saved successfully!
ar: تم حفظ التفضيلات بنجاح!
fr: Préférences enregistrées avec succès !

source: Select Quran Version...
ar: اختر نسخة القرآن...
fr: Sélectionner la version du Coran...

source: Select Reciter...
ar: اختر القارئ...
fr: Sélectionner un récitateur...

source: Select Repetition Reciter...
ar: اختر قارئ التكرار...
fr: Sélectionner un récitateur de répétition...

source: Select Theme...
ar: اختر المظهر...
fr: Sélectionner un thème...

source: Select Tafsir...
ar: اختر التفسير...
fr: Sélectionner un Tafsir...

source: Arabic
ar: العربية
fr: Arabe

source: Uthmani
ar: عثماني

source: Simple
ar: بسيط

source: English
ar: الإنجليزية
fr: Anglais

source: French
ar: الفرنسية
fr: Français

source: Playback Speed
ar: سرعة التشغيل
fr: Vitesse de lecture

source: Sleep Timer
ar: مؤقت النوم
fr: Minuterie de veille

source: Sleep timer ended
ar: انتهى مؤقت النوم
fr: La minuterie de veille est terminée

source: minutes
ar: دقائق

# minutesShort
source: {minutes} min
ar: {minutes} د

source: Off
ar: إيقاف
fr: Désactivé

source: Buffering...
ar: جاري التحميل...
fr: Mise en mémoire tampon...

source: Error loading audio
ar: خطأ في تحميل الصوت
fr: Erreur lors du chargement de l'audio

source: Retry
ar: إعادة المحاولة
fr: Réessayer

source: Bookmark
ar: إشارة مرجعية
fr: Marque-page

source: Bookmarked
ar: تمت الإضافة للإشارات
fr: Ajouté aux marque-pages

source: Verse by Verse
ar: آية بآية
fr: Verset par verset

# autoPlayNext
source: Auto Play
ar: تشغيل تلقائي
fr: Lecture automatique

# featureSurah
source: Favorite
ar: تمييز السورة
fr: Mettre en favori

# removeFeatureSurah
source: Remove from favorites
ar: إزالة تمييز السورة
fr: Retirer des favoris

# surahFeatured
source: Surah added to favorites
ar: تمت إضافة السورة إلى المفضلة
fr: Sourate ajoutée aux favoris

# surahUnfeatured
source: Surah removed from favorites
ar: تمت إزالة السورة من المفضلة
fr: Sourate retirée des favoris

# queue
source: Playlist
ar: قائمة التشغيل
fr: Liste de lecture

source: Add to Queue
ar: إضافة إلى القائمة
fr: Ajouter à la file d'attente

source: Clear Queue
ar: مسح القائمة
fr: Vider la file d'attente

source: Download
ar: تحميل
fr: Télécharger

source: Downloaded
ar: تم التحميل
fr: Téléchargé

# selectReciterFirst
source: Please select a reciter first.
ar: يرجى اختيار قارئ أولاً.
fr: Veuillez d'abord sélectionner un récitateur.

# downloadReciterTitle
source: Download audio
ar: تحميل الصوت
fr: Télécharger l'audio

# downloadReciterMessage
source: Download all 114 surahs for this reciter for offline listening?
ar: تحميل جميع السور الـ 114 لهذا القارئ للاستماع دون اتصال؟
fr: Télécharger les 114 sourates de ce récitateur pour une écoute hors ligne ?

source: Download complete
ar: اكتمل التحميل
fr: Téléchargement terminé

source: Download failed
ar: فشل التحميل
fr: Échec du téléchargement

# downloadCurrentSurahTitle
source: Download this surah?
ar: تحميل هذه السورة؟
fr: Télécharger cette sourate ?

# downloadCurrentSurahMessage
source: Download the current surah for offline listening?
ar: هل تريد تنزيل هذه السورة لتعمل لاحقًا دون اتصال؟
fr: Télécharger la sourate actuelle pour une écoute hors ligne ?

source: Downloading surah...
ar: جاري تنزيل السورة...
fr: Téléchargement de la sourate...

# downloadProgressTitle
source: Downloading...
ar: جاري التحميل...
fr: Téléchargement en cours...

# surahUnavailable
source: Audio not available for this surah. Try another reciter.
ar: الصوت غير متوفر لهذه السورة. جرب قارئاً آخر.
fr: Audio non disponible pour cette sourate. Essayez un autre récitateur.

source: Cancel
ar: إلغاء
fr: Annuler

source: Go
ar: اذهب
fr: Aller

source: Play page audio
ar: تشغيل تلاوة الصفحة
fr: Lecture audio de la page

# playSurahAudio
source: Play audio
ar: تشغيل التلاوة
fr: Lecture audio

source: Pause page audio
ar: إيقاف مؤقت لتلاوة الصفحة
fr: Mettre en pause l'audio de la page

# pauseSurahAudio
source: Pause audio
ar: إيقاف مؤقت للتلاوة
fr: Mettre en pause l'audio

source: Stop playback
ar: إيقاف التشغيل
fr: Arrêter la lecture

# previousAyah
source: Previous verse
ar: الآية السابقة
fr: Verset précédent

# highlightedAyahs
source: Highlighted verses
ar: الآيات المميزة
fr: Versets surlignés

# noHighlightsYet
source: You have not highlighted any verses yet.
ar: لا توجد آيات مميزة بعد.
fr: Vous n'avez pas encore mis de verset en évidence.

source: Go to page
ar: انتقل إلى الصفحة
fr: Aller à la page

source: Page Number
ar: رقم الصفحة
fr: Numéro de page

# previousPage
source: Previous
ar: السابقة
fr: Précédente

# nextPage
source: Next
ar: التالية
fr: Suivante

source: Page
ar: الصفحة

source: Surah
ar: السورة
fr: Sourate

source: Tap to change
ar: انقر للتغيير
fr: Touchez pour changer

# chooseSurah
source: Choose a surah
ar: اختر سورة
fr: Choisir une sourate

# chooseJuz
source: Choose a juz
ar: اختر جزء
fr: Choisir un juz

# juzLabel
source: Juz
ar: جزء

source: Search...
ar: ابحث...
fr: Rechercher...

source: Search results: {count}
ar: نتائج البحث: {count}
fr: Résultats de recherche : {count}

# searchResultsDetailed
source: {occurrences} results in {ayahs} ayahs
ar: {occurrences} نتيجة في {ayahs} آية
fr: {occurrences} résultats dans {ayahs} versets

# noResultsFound
source: No results found for your query.
ar: لم يتم العثور على نتائج للبحث.
fr: Aucun résultat pour votre recherche.

# addHighlight
source: Highlight verse
ar: تمييز الآية
fr: Mettre en surbrillance le verset

source: Remove highlight
ar: إزالة التمييز
fr: Retirer la surbrillance

source: Show English translation
ar: عرض الترجمة الإنجليزية
fr: Afficher la traduction anglaise

source: Show French translation
ar: عرض الترجمة الفرنسية
fr: Afficher la traduction française

source: Show Arabic text
ar: عرض النص العربي
fr: Afficher le texte arabe

source: Show tafsir
ar: عرض التفسير
fr: Afficher le tafsir

# translationNotAvailable
source: Translation not available for this verse.
ar: الترجمة غير متوفرة لهذه الآية.
fr: Traduction indisponible pour ce verset.

source: Close
ar: إغلاق
fr: Fermer

# selectLabel
source: Choose
ar: اختر
fr: Choisir

# selectedLabel
source: Selected
ar: تم الاختيار
fr: Sélectionné

source: Refresh
ar: تحديث
fr: Actualiser

# prayerInternetGpsRequired
source: Internet and GPS are required to show prayer times.
ar: يلزم الاتصال بالإنترنت وتفعيل GPS لعرض أوقات الصلاة.
fr: Internet et GPS sont requis pour afficher les heures de prière.

# dayColumn
source: Day
ar: اليوم
fr: Jour

source: Imsak
ar: الإمساك

source: Current Verse
ar: الآية الحالية
fr: Verset actuel

source: Share
ar: مشاركة
fr: Partager

source: Copied to clipboard
ar: تم النسخ إلى الحافظة
fr: Copié dans le presse-papiers

source: Resume from last position
ar: استئناف من آخر موضع
fr: Reprendre à partir de la dernière position

# searchTooShort
source: Enter at least 2 characters
ar: أدخل حرفين على الأقل
fr: Entrez au moins 2 caractères

# unknownError
source: An error occurred
ar: حدث خطأ ما
fr: Une erreur s'est produite

# qiblaTitle
source: Qibla Direction
ar: اتجاه القبلة
fr: Direction de la Qibla

# qiblaRetry
source: Retry
ar: إعادة المحاولة
fr: Réessayer

# qiblaCheckingStatus
source: Checking permissions and sensors...
ar: جاري التحقق من الصلاحيات والمستشعرات...
fr: Vérification des autorisations et capteurs...

# qiblaTurnUntilArrowUp
source: Turn until the arrow points up
ar: اتجه حتى يشير السهم إلى الأعلى
fr: Tournez jusqu'à ce que la flèche pointe vers le haut

# qiblaPermissionRequired
source: Location permission is required to determine the Qibla.
ar: يلزم منح صلاحية الموقع لتحديد اتجاه القبلة.
fr: L'autorisation de localisation est requise pour déterminer la qibla.

# qiblaLocationDisabled
source: Please enable location services (GPS) to continue.
ar: يرجى تفعيل خدمات الموقع (GPS) للمتابعة.
fr: Veuillez activer les services de localisation (GPS) pour continuer.

# qiblaOpenAppSettings
source: Open App Settings
ar: فتح إعدادات التطبيق
fr: Ouvrir les paramètres de l'application

# qiblaOpenLocationSettings
source: Open Location Settings
ar: فتح إعدادات الموقع
fr: Ouvrir les paramètres de localisation

# qiblaSensorNotSupported
source: This device does not support the required sensors for compass mode.
ar: هذا الجهاز لا يدعم الحساسات المطلوبة لوضع البوصلة.
fr: Cet appareil ne prend pas en charge les capteurs nécessaires au mode boussole.

# verseOutsideRange
source: This verse is outside the selected range.
ar: هذه الآية خارج النطاق المحدد.
fr: Ce verset est en dehors de la plage sélectionnée.

# qiblaAngleLabel
source: Qibla angle: {angle}°
ar: زاوية القبلة: {angle}°
fr: Angle de la Qibla : {angle}°

# qiblaTipGps
source: Enable GPS and High Accuracy
ar: فعّل GPS ودقة عالية
fr: Activez le GPS et la haute précision

# qiblaTipCalibrate
source: Calibrate: move phone ∞
ar: حرّك الهاتف بشكل ∞ للمعايرة
fr: Calibrez : mouvement ∞ du téléphone

# qiblaTipInterference
source: Avoid metal/magnetic interference
ar: أبعد الجهاز عن المعادن/المغناطيس
fr: Évitez les interférences métalliques/magnétiques

# testResultTitle
source: Test Result
ar: نتيجة الاختبار
fr: Résultat du test

# testCongratsTitle
source: Well done!
ar: أحسنت!
fr: Bien joué !

# correctAnswersLabel
source: Correct answers: {correct} / {total}
ar: الإجابات الصحيحة: {correct} / {total}
fr: Bonnes réponses : {correct} / {total}

# percentageLabel
source: Percentage: {percent}%
ar: النسبة المئوية: {percent}%
fr: Pourcentage : {percent}%

# earnedScoreLabel
source: Earned score: {score}
ar: العلامات المكتسبة: {score}
fr: Score obtenu : {score}

# totalScoreLabel
source: Total score
ar: العلامات المتراكمة
fr: Score total

# endLabel
source: Finish
ar: إنهاء
fr: Terminer

# newTestLabel
source: New test
ar: اختبار جديد
fr: Nouveau test

# previousLabel
source: Previous
ar: السابق
fr: Précédent

# nextLabel
source: Next
ar: التالي
fr: Suivant

# showResultsLabel
source: Show results
ar: عرض النتائج
fr: Afficher les résultats

# confirmAnswerLabel
source: Confirm answer
ar: تأكيد الإجابة
fr: Confirmer la réponse

# exitTestTitle
source: End test
ar: إنهاء الاختبار
fr: Terminer le test

# exitTestConfirm
source: Are you sure you want to end the test and show results?
ar: هل أنت متأكد أنك تريد إنهاء الاختبار وعرض النتائج؟
fr: Voulez-vous vraiment terminer le test et afficher les résultats ?

source: Font size
ar: حجم الخط
fr: Taille de police

source: Small
ar: صغير
fr: Petit

source: Medium
ar: متوسط
fr: Moyen

source: Large
ar: كبير
fr: Grand

source: Extra Large
ar: كبير جداً
fr: Très grand

source: Verse repeat count
ar: عدد تكرار الآية
fr: Nombre de répétitions du verset

# verseRepeatCountHint
source: Repeat each verse this many times during repetition memorization.
ar: كرر كل آية هذا العدد من المرات أثناء الحفظ بالتكرار.
fr: Répétez chaque verset ce nombre de fois pendant la mémorisation.

source: Arabic font
ar: الخط العربي
fr: Police arabe

# fontAmiri
source: Amiri Quran
ar: أميري قرآن

# fontScheherazade
source: Scheherazade New
ar: شهرزاد الجديدة

# fontLateef
source: Lateef
ar: لطيف

# offlineAudioTitle
source: Offline audio
ar: الصوت دون اتصال
fr: Audio hors ligne
